###############################################################
#  Generated by:      Cadence Innovus 20.15-s105_1
#  OS:                Linux x86_64(Host ID ee25)
#  Generated on:      Sat May 24 17:39:25 2025
#  Design:            CHIP
#  Command:           routeDesign -globalDetail -viaOpt -wireOpt
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 20.000000 -waveform {0.000000 10.000000}
set_propagated_clock  [get_ports {clk}]
set_drive 0.1  [get_ports {clk}]
set_drive 0.1  [get_ports {rst_n}]
set_drive 0.1  [get_ports {in_valid}]
set_drive 0.1  [get_ports {in_valid2}]
set_drive 0.1  [get_ports {in_data[11]}]
set_drive 0.1  [get_ports {in_data[10]}]
set_drive 0.1  [get_ports {in_data[9]}]
set_drive 0.1  [get_ports {in_data[8]}]
set_drive 0.1  [get_ports {in_data[7]}]
set_drive 0.1  [get_ports {in_data[6]}]
set_drive 0.1  [get_ports {in_data[5]}]
set_drive 0.1  [get_ports {in_data[4]}]
set_drive 0.1  [get_ports {in_data[3]}]
set_drive 0.1  [get_ports {in_data[2]}]
set_drive 0.1  [get_ports {in_data[1]}]
set_drive 0.1  [get_ports {in_data[0]}]
set_load -pin_load -max  20  [get_ports {out_valid}]
set_load -pin_load -min  20  [get_ports {out_valid}]
set_load -pin_load -max  20  [get_ports {out_sad}]
set_load -pin_load -min  20  [get_ports {out_sad}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[11]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[8]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[6]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[4]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[2]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[0]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[10]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[9]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[7]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[5]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_valid2}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[3]}]
set_input_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {in_data[1]}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_sad}]
set_output_delay -add_delay 10 -clock [get_clocks {clk}] [get_ports {out_valid}]
