###############################################################
#  Generated by:      Cadence Innovus 20.15-s105_1
#  OS:                Linux x86_64(Host ID ee25)
#  Generated on:      Fri May 30 02:55:51 2025
#  Design:            CHIP
#  Command:           routeDesign -globalDetail -viaOpt -wireOpt
###############################################################
current_design CHIP
create_clock [get_ports {clk}]  -name clk -period 11.000000 -waveform {0.000000 5.500000}
set_propagated_clock  [get_ports {clk}]
set_drive 0.1  [get_ports {clk}]
set_drive 0.1  [get_ports {rst_n}]
set_drive 0.1  [get_ports {in_valid}]
set_drive 0.1  [get_ports {delay[3]}]
set_drive 0.1  [get_ports {delay[2]}]
set_drive 0.1  [get_ports {delay[1]}]
set_drive 0.1  [get_ports {delay[0]}]
set_drive 0.1  [get_ports {source[3]}]
set_drive 0.1  [get_ports {source[2]}]
set_drive 0.1  [get_ports {source[1]}]
set_drive 0.1  [get_ports {source[0]}]
set_drive 0.1  [get_ports {destination[3]}]
set_drive 0.1  [get_ports {destination[2]}]
set_drive 0.1  [get_ports {destination[1]}]
set_drive 0.1  [get_ports {destination[0]}]
set_load -pin_load -max  20  [get_ports {out_valid}]
set_load -pin_load -min  20  [get_ports {out_valid}]
set_load -pin_load -max  20  [get_ports {worst_delay[7]}]
set_load -pin_load -min  20  [get_ports {worst_delay[7]}]
set_load -pin_load -max  20  [get_ports {worst_delay[6]}]
set_load -pin_load -min  20  [get_ports {worst_delay[6]}]
set_load -pin_load -max  20  [get_ports {worst_delay[5]}]
set_load -pin_load -min  20  [get_ports {worst_delay[5]}]
set_load -pin_load -max  20  [get_ports {worst_delay[4]}]
set_load -pin_load -min  20  [get_ports {worst_delay[4]}]
set_load -pin_load -max  20  [get_ports {worst_delay[3]}]
set_load -pin_load -min  20  [get_ports {worst_delay[3]}]
set_load -pin_load -max  20  [get_ports {worst_delay[2]}]
set_load -pin_load -min  20  [get_ports {worst_delay[2]}]
set_load -pin_load -max  20  [get_ports {worst_delay[1]}]
set_load -pin_load -min  20  [get_ports {worst_delay[1]}]
set_load -pin_load -max  20  [get_ports {worst_delay[0]}]
set_load -pin_load -min  20  [get_ports {worst_delay[0]}]
set_load -pin_load -max  20  [get_ports {path[3]}]
set_load -pin_load -min  20  [get_ports {path[3]}]
set_load -pin_load -max  20  [get_ports {path[2]}]
set_load -pin_load -min  20  [get_ports {path[2]}]
set_load -pin_load -max  20  [get_ports {path[1]}]
set_load -pin_load -min  20  [get_ports {path[1]}]
set_load -pin_load -max  20  [get_ports {path[0]}]
set_load -pin_load -min  20  [get_ports {path[0]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {in_valid}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {rst_n}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {destination[2]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {delay[3]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {destination[0]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {delay[1]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {source[2]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {source[0]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {destination[3]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {destination[1]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {delay[2]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {delay[0]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {source[3]}]
set_input_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {source[1]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[7]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[5]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[3]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {path[3]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[1]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {path[1]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {out_valid}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[6]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[4]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[2]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {path[2]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {worst_delay[0]}]
set_output_delay -add_delay 5.5 -clock [get_clocks {clk}] [get_ports {path[0]}]
